Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཀེང་རུས་གཟུངས་མེད་པ། གྱེས་པ། དུང་གི་མདོག་ལྟར་གྱུར་པ། ས་ལ་རྣམ་པར་འཐོར་བ་མཐོང་བ་དེའི་ཚེ། དེ་ལུས་འདི་ཉིད་ཀྱི་ཚུལ་ཡང་དེ་དང་ཉེ་བར་སྦྱོར་ཏེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, on seeing the bones and skeletons in a charnel ground, without adhesion, separated, as white as conch shells, and scattered over the ground, they compare these to the circumstances of their own bodies, reflecting, ‘This body too has attributes such as these.

source: ལུས་འདི་ཡང་འདི་ལྟ་བུའི་ཆོས་ཅན། འདི་ལྟ་བུའི་རང་བཞིན་ཅན་ཏེ།
en: It has a nature such as these.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་དུར་ཁྲོད་ཀྱི་རུས་པ་ས་ལ། ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་རྣམ་པར་འཐོར་བ། རྐང་པའི་རུས་པ་རྣམས་ཀྱང་གཞན་དུ་འཐོར། བྱིན་པའི་རུས་པ་རྣམས་ཀྱང་གཞན་དུ་འཐོར། བརླའི་རུས་པ་རྣམས་ཀྱང་གཞན་དུ་འཐོར། དཔྱིའི་རུས་པ་རྣམས་ཀྱང་གཞན་དུ་འཐོར། ཚིགས་པའི་རུས་པ་རྣམས་ཀྱང་གཞན་དུ་འཐོར། རྩིབ་མའི་རུས་པ་རྣམས་ཀྱང་གཞན་དུ་འཐོར། མཇིང་པའི་རུས་པ་རྣམས་ཀྱང་གཞན་དུ་འཐོར། མགོའི་རུས་པ་རྣམས་ཀྱང་གཞན་དུ་འཐོར་བ་མཐོང་ན།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, on seeing the bones in a charnel ground, scattered in the cardinal and intermediate directions, the foot bones scattered apart, the shin bones scattered apart, the thigh bones scattered apart, the hip bones scattered apart, the wrist bones scattered apart, the rib bones scattered apart, the neck bones scattered apart, and the skull bones also scattered apart, they compare these to the circumstances of their own bodies, reflecting, ‘This body too has attributes such as these.

source: ཆོས་ཉིད་འདི་ལྟ་བུ་ལས་མ་འདས་པའོ།
en: It does not go beyond this reality!’

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་དུར་ཁྲོད་ཀྱི་རུས་པ་ལོ་དུ་མ་ལོན་པ། རླུང་དང་ཉི་མས་གདུངས་པ། དུང་གི་མདོག་ལྟར་གྱུར་པ་མཐོང་བ་དེའི་ཚེ། དེ་ལུས་འདི་ཉིད་ཀྱང་དེ་དང་ཉེ་བར་སྦྱོར་ཏེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, on seeing the bones in a charnel ground, many years old, weathered by the wind and the sun, and as white as conch shells, they compare these to the circumstances of their own bodies, reflecting, ‘This body too has attributes such as these. [

source: ལུས་འདི་ཡང་འདི་ལྟ་བུའི་ཆོས་ཅན་ཏེ།
en: It has a nature such as these.]

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཕྱིའི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: Subhūti, it is in this way that when bodhisattva great beings practice the perfection of wisdom, with regard to the outer body, they observe the physical body without apprehending anything.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་དུར་ཁྲོད་ཀྱི་རུས་པ་ལོ་དུ་མ་ལོན་པ། རབ་རིབ་སྣང་བ། སྔོན་པོར་གྱུར་པ། ཐི་བའི་མདོག་ལྟར་གྱུར་པ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, on seeing the bones in a charnel ground, many years old, indistinct, bluish grey like a pigeon, tattered, disintegrated, and turning into dust on the ground, they compare these to the circumstances of their own bodies, reflecting, ‘This body too has attributes such as these.

source: ཟེགས་པ།
en: It has a nature such as these.

source: བྲུལ་བ། སའི་རྡུལ་དང་འདྲེན་འདྲེན་དུ་གྱུར་པ་མཐོང་བ་དེའི་ཚེ། དེ་ལུས་འདི་ཉིད་ཀྱི་ཚུལ་ཡང་དེ་དང་སྦྱོར་ཏེ།
en: It does not go beyond this reality!’

source: ལུས་འདི་ཉིད་ཀྱང་འདི་ལྟ་བུའི་ཆོས་ཅན། འདི་ལྟ་བུའི་རང་བཞིན་ཅན་ཏེ། འདི་ལྟ་བུའི་ཆོས་ཉིད་ལས་མ་འདས་པའོ་ཞེས་བྱ་བར་ཉེ་བར་རྟོག་གོ །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནང་གི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལུས་ཀྱི་རྗེས་སུ་ལྟ།
en: Subhūti, it is in this way that when bodhisattva great beings practice the perfection of wisdom, with regard to the inner body, they observe the physical body without apprehending anything.

source: ཕྱིའི་ལུས་དང་། ཕྱི་ནང་གི་ལུས་འདི་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: With regard to the outer body and with regard to the outer and inner body combined, they observe the physical body without apprehending anything.

source: །ནང་གི་ཚོར་བ་དང་། ཕྱིའི་ཚོར་བ་དང་། ཕྱི་ནང་གི་ཚོར་བ་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཚོར་བའི་རྗེས་སུ་ལྟ།
en: With regard to inner feelings, outer feelings, and outer and inner feelings combined, they observe feelings without apprehending anything.

source: ནང་གི་སེམས་དང་། ཕྱིའི་སེམས་དང་། ཕྱི་ནང་གི་སེམས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་སེམས་ཀྱི་རྗེས་སུ་ལྟ།
en: With regard to inner mind, outer mind, and outer and inner mind combined, they observe mind without apprehending anything.

source: ནང་གི་ཆོས་དང་། ཕྱིའི་ཆོས་དང་། ཕྱི་ནང་གི་ཆོས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: With regard to inner phenomena, outer phenomena, and outer and inner phenomena combined, they observe phenomena without apprehending anything.

source: བརྩོན་འགྲུས་ཅན། ཤེས་བཞིན་དང་ལྡན་པ། དྲན་པ་དང་ལྡན་པས། འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསྩལ་ཅིང་རྣམ་པར་སྤྱོད་དོ།
en: As they conduct themselves, diligent, alert, and mindful, they are rid of the world’s attractions and dissatisfactions.

source: །རབ་འབྱོར་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ།
en: This indeed, Subhūti, is the Great Vehicle of bodhisattva great beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་འདི་ལྟར་ཡང་དག་པར་སྤོང་བ་བཞི་སྟེ།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings also entails the four correct exertions.

source: བཞི་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་བསྐྱེད་པའི་ཕྱིར། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་མོས་པར་སྐྱེད་ཅིང་རྩོལ་ལོ། །བརྩོན་འགྲུས་རྩོམ་མོ། །སེམས་ཀྱི་མཐུ་སྐྱེད་དོ། །ཡང་དག་པར་སྨོན་ལམ་འདེབས་སོ།
en: If you ask what these four are, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, (1) without apprehending anything, they resolve, struggle, strive, develop tenacity, and rightly aspire that negative and nonvirtuous states that have not yet arisen might not be developed. (

source: །སྡིག་ཏོ་མི་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་སྤང་བའི་ཕྱིར། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་མོས་པ་སྐྱེད་ཅིང་རྩོལ་ལོ། །བརྩོན་འགྲུས་རྩོམ་མོ། །སེམས་ཀྱི་མཐུ་སྐྱེད་དོ། །ཡང་དག་པར་སྨོན་ལམ་འདེབས་སོ། །དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པའི་ཕྱིར།
en: 2) Without apprehending anything, they resolve, struggle, strive, develop tenacity, and rightly aspire that negative and nonvirtuous states that have previously arisen might be renounced. (

source: དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་མོས་པ་སྐྱེད་ཅིང་རྩོལ་ལོ། །བརྩོན་འགྲུས་རྩོམ་མོ། །སེམས་ཀྱི་མཐུ་སྐྱེད་དོ། །ཡང་དག་པར་སྨོན་ལམ་འདེབས་སོ། །དགེ་བའི་ཆོས་སྐྱེས་པའི་རྣམས་གནས་པ་དང་། ཕྱིར་ཞིང་བསྒོམ་པ་དང་།
en: 3) Without apprehending anything, they resolve, struggle, strive, develop tenacity, and rightly aspire that virtuous states that have not yet arisen might be developed. (

source: ཉམས་པར་མི་འགྱུར་བ་དང་། ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་མོས་པ་སྐྱེད་ཅིང་རྩོལ་ལོ། །བརྩོན་འགྲུས་རྩོམ་མོ། སེམས་ཀྱི་མཐུ་སྐྱེད་དོ།
en: 4) Without apprehending anything, they resolve, struggle, strive, develop tenacity, and rightly aspire that virtuous states that have previously arisen might remain stable, be repeatedly cultivated, be undiminished, and be fully cultivated.

source: །ཡང་དག་པར་སྨོན་ལམ་འདེབས་ཏེ། །རབ་འབྱོར་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ།
en: This indeed, Subhūti, is the Great Vehicle of bodhisattva great beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟར་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་སྟེ།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings also entails the four supports for miraculous ability.

source: བཞི་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མོས་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་། ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དབེན་པ་ལ་གནས་པ།
en: If you ask what these four are, in this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, (1) imbued with renunciation, dwelling in solitude, maintaining detachment, and remaining in a state of cessation, they should cultivate the support for miraculous ability that combines meditative stability of resolution with the formative force of exertion. (

source: འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤོང་བས་ཡོངས་སུ་གྲུབ་པ་སྒོམ་མོ། །བརྩོན་འགྲུས་ཀྱི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: 2) Imbued with renunciation, dwelling in solitude, maintaining detachment, and remaining in a state of cessation, they should cultivate the support for miraculous ability that combines meditative stability of perseverance with the formative force of exertion. (

source: འགོག་པ་ལ་གནས་པ། རྣམ་པར་སྤོང་བས་ཡོངས་སུ་གྲུབ་པ་སྒོམ་མོ། །སེམས་ཀྱི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: 3) Imbued with renunciation, dwelling in solitude, maintaining detachment, and remaining in a state of cessation, they should cultivate the support for miraculous ability that combines meditative stability of mind with the formative force of exertion. (

source: འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤོང་བས་ཡོངས་སུ་གྲུབ་པ་སྒོམ་མོ། །དཔྱོད་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤོང་བས་ཡོངས་སུ་གྲུབ་པ་སྒོམ་སྟེ།
en: 4) Imbued with renunciation, dwelling in solitude, maintaining detachment, and remaining in a state of cessation, they should cultivate the support for miraculous ability that combines meditative stability of scrutiny with the formative force of exertion. [

source: རབ་འབྱོར་འདི་ཡང་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ།
en: Cultivated] without apprehending anything, this indeed, Subhūti, is the Great Vehicle of bodhisattva great beings. {

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟར་དབང་པོ་ལྔ་སྟེ།
en: Dt.208} “Moreover, Subhūti, the Great Vehicle of bodhisattva great beings also entails the five faculties.

source: ལྔ་གང་ཞེ་ན། དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་།
en: If you ask what these five are, they comprise (1) the faculty of faith, (2) the faculty of perseverance, (3) the faculty of recollection, (4) the faculty of meditative stability, and (5) the faculty of wisdom. [

source: ཤེས་རབ་ཀྱི་དབང་པོ་སྟེ། རབ་འབྱོར་འདི་ཡང་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ།
en: Cultivated] without apprehending anything, this indeed, Subhūti, is the Great Vehicle of bodhisattva great beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟར་སྟོབས་ལྔ་སྟེ།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings also entails the five powers.

source: །ལྔ་གང་ཞེ་ན། དད་པའི་སྟོབས་དང་། བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་། དྲན་པའི་སྟོབས་དང་། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་།
en: If you ask what these five are, they comprise (1) the power of faith, (2) the power of perseverance, (3) the power of recollection, (4) the power of meditative stability, and (5) the power of wisdom. [

source: ཤེས་རབ་ཀྱི་སྟོབས་ཏེ། རབ་འབྱོར་འདི་ཡང་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ།
en: Cultivated] without apprehending anything, this indeed, Subhūti, is the Great Vehicle of bodhisattva great beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟར་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ཏེ།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings also entails the seven branches of enlightenment.

source: བདུན་གང་ཞེ་ན།
en: You may ask what these seven are.

source: དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤོང་བས། ཡོངས་སུ་གྲུབ་པ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་སྒོམ་མོ། །ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་།
en: Imbued with renunciation, dwelling in solitude, maintaining detachment, and remaining in a state of cessation, and without apprehending anything, they should cultivate (1) the branch of enlightenment that is correct recollection.

source: བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཤིན་དུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: Imbued with renunciation, dwelling in solitude, maintaining detachment, and remaining in a state of cessation, and without apprehending anything, they should cultivate (2) the branch of enlightenment that is correct doctrinal analysis, (3) the branch of enlightenment that is correct perseverance, (4) the branch of enlightenment that is correct delight, (5) the branch of enlightenment that is correct mental and physical refinement, (6) the branch of enlightenment that is correct meditative stability, and (7) the branch of enlightenment that is correct equanimity.

source: འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤོང་བས། ཡོངས་སུ་གྲུབ་པ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་སྒོམ་སྟེ། རབ་འབྱོར་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ།
en: This indeed, Subhūti, is the Great Vehicle of bodhisattva great beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟར་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྟེ།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings also entails [the observances of] the noble eightfold path.

source: དེ་ཡང་གང་ཞེ་ན།
en: You may ask what these are.

source: ཡང་དག་པའི་ལྟ་བ་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ། འགོག་པ་ལ་གནས་པ་རྣམ་པར་སྤོང་བས། ཡོངས་སུ་གྲུབ་པ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་སྒོམ་མོ། །ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་།
en: Imbued with renunciation, dwelling in solitude, maintaining detachment, and remaining in a state of cessation, and without apprehending anything, they should cultivate (1) correct view.

source: ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་དབེན་པ་ལ་གནས་པ། འདོད་ཆགས་དང་བྲལ་བ་ལ་གནས་པ།
en: Imbued with renunciation, dwelling in solitude, maintaining detachment, and remaining in a state of cessation, and without apprehending anything, they should cultivate (2) correct thought, (3) correct speech, (4) correct action, (5) correct livelihood, (6) correct effort, (7) correct recollection, and (8) correct meditative stability.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་འདི་ལྟར། ཏིང་ངེ་འཛིན་གསུམ་སྟེ།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings also entails the three meditative stabilities.

source: གསུམ་གང་ཞེ་ན། སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་དང་། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཏོ།
en: If you ask what these three are, they comprise (1) the meditative stability of emptiness, (2) the meditative stability of signlessness, and (3) the meditative stability of wishlessness.

source: །དེ་ལ་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་དུ་རྟོག་པའི་ཚེ། སེམས་གནས་པ་སྟོང་པ་ཉིད་རྣམ་པར་ཐར་པའི་སྒོ་སྟེ།
en: In this regard, if you ask what is the meditative stability of emptiness, when all phenomena are observed to be empty of their own defining characteristics, that stability of mind is the gateway to liberation known as emptiness.

source: འདི་ནི་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ།
en: This is called the meditative stability of emptiness.

source: །དེ་ལ་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པར་རྟོག་པའི་ཚེ། སེམས་གནས་པ་མཚན་མ་མེད་པ་རྣམ་པར་ཐར་པའི་སྒོ་སྟེ།
en: If you ask what is the meditative stability of signlessness, when all phenomena are observed to be devoid of signs, that stability of mind is the gateway to liberation known as signlessness.

source: འདི་ནི་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ།
en: This is called the meditative stability of signlessness.

source: །དེ་ལ་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཆོས་ཐམས་ཅད་མངོན་པར་འདུ་བྱ་བ་མེད་དོ། །ཞེས་མངོན་བར་འདུ་མི་བྱེད་པའི་ཚེ། སེམས་གནས་པ་སྨོན་པ་མེད་པ་རྣམ་པར་ཐར་པའི་སྒོ་སྟེ།
en: If you ask what is the meditative stability of wishlessness, when there is no conditioning, understanding that all phenomena cannot be conditioned, that stability of mind is the gateway to liberation known as wishlessness.

source: འདི་ནི་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ།
en: This is called the meditative stability of wishlessness.

source: །རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་པོ་དེ་དག་ལ་ཞུམ་པ་མེད་པར་དྲན་པར་བྱ་སྟེ།
en: One should be mindful of these three gateways to liberation, without discouragement.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟར་ཤེས་པ་བཅུ་གཅིག་སྟེ།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings also entails the eleven aspects of knowledge.

source: བཅུ་གཅིག་གང་ཞེ་ན། སྡུག་བསྔལ་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་དང་། འགོག་པ་ཤེས་པ་དང་། ལམ་ཤེས་པ་དང་། ཟད་པ་ཤེས་པ་དང་། མི་སྐྱེ་བ་ཤེས་པ་དང་། ཆོས་ཤེས་པ་དང་།
en: If you ask what these eleven are, they comprise (1) knowledge of suffering, (2) knowledge of the origin of suffering, (3) knowledge of the cessation of suffering, (4) knowledge of the path, (5) knowledge of the extinction of contaminants, (6) knowledge that contaminants will not arise again, (7) knowledge of phenomena, (8) knowledge of phenomena that is subsequently realized, (9) knowledge of the relative, (10) knowledge that is masterful, and (11) knowledge that is semantic. {

source: རྗེས་སུ་རྟོགས་པ་ཤེས་པ་དང་། ཀུན་རྫོབ་ཤེས་པ་དང་། འདྲིས་པ་ཤེས་པ་དང་། སྒྲ་ཇི་བཞིན་ཤེས་པའོ། །དེ་ལ་སྡུག་བསྔལ་ཤེས་པ་གང་ཞེ་ན།
en: Dt.209} In this regard, if you ask what is knowledge of suffering, it is the knowledge that suffering does not arise.

source: སྡུག་བསྔལ་མི་སྐྱེ་བར་ཤེས་པའོ། །དེ་ལ་ཀུན་འབྱུང་བ་ཤེས་པ་གང་ཞེ་ན། ཀུན་འབྱུང་བ་སྤོང་བར་ཤེས་པའོ།
en: If you ask what is knowledge of the origin of suffering, it is the knowledge that the origin of suffering has been renounced.

source: །དེ་ལ་འགོག་པ་ཤེས་པ་གང་ཞེ་ན། སྡུག་བསྔལ་འགོག་པར་ཤེས་པའོ།
en: If you ask what is knowledge of the cessation of suffering, it is the knowledge that suffering has ceased.

source: །དེ་ལ་ལམ་ཤེས་པ་གང་ཞེ་ན། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཤེས་པའོ།
en: If you ask what is knowledge of the path, it is the knowledge of the noble eightfold path.

source: །དེ་ལ་ཟད་པ་ཤེས་པ་གང་ཞེ་ན། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཟད་པར་ཤེས་པའོ།
en: If you ask what is knowledge of the extinction of contaminants, it is the knowledge that desire, hatred, and delusion have been extinguished.

source: །དེ་ལ་མི་སྐྱེ་བ་ཤེས་པ་གང་ཞེ་ན། སྲིད་པའི་རྒྱུད་སྐྱེ་བ་མེད་པར་ཤེས་པའོ།
en: If you ask what is knowledge that contaminants will not arise again, it is the knowledge that the continuum of rebirth does not arise.

source: །དེ་ལ་ཆོས་ཤེས་པ་གང་ཞེ་ན། ཕུང་པོ་ལྔ་སྒྱུ་མར་ཡོངས་སུ་རྟོགས་ཤིང་ཤེས་པའོ།
en: If you ask what is knowledge of phenomena, it is the knowledge that the five psycho-physical aggregates are understood to be illusory.

source: །དེ་ལ་རྗེས་སུ་རྟོགས་པ་ཤེས་པ་གང་ཞེ་ན། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མི་རྟག་ཅེས་བྱ་བར་ཤེས་པའོ།
en: If you ask what is knowledge of phenomena that is subsequently realized, it is the knowledge that the sense fields, the sensory elements, and the links of dependent origination are impermanent.

source: །དེ་ལ་ཀུན་རྫོབ་ཤེས་པ་གང་ཞེ་ན། སེམས་ཅན་གཞན་དང་གང་ཟག་གཞན་གྱི་སེམས་སེམས་ཀྱིས་ཤེས་པའོ།
en: If you ask what is knowledge of the relative, it is the knowledge, through the mind, of the minds of other beings and of other individuals.

source: །དེ་ལ་འདྲིས་པ་ཤེས་པ་གང་ཞེ་ན། གང་གིས་ལམ་ཤེས་པ་དང་། ཡོངས་སུ་བྱང་བ་ཤེས་པའོ།
en: If you ask what is knowledge that is masterful, it is that by which there ensues knowledge of the path and knowledge of refinement.

source: །དེ་ལ་སྒྲ་ཇི་བཞིན་ཤེས་པ་གང་ཞེ་ན། དེ་བཞིན་གཤེགས་པའི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཏེ།
en: If you ask what is knowledge that is semantic, it is the wisdom of all-aspect omniscience that the tathāgatas have. [

source: རབ་འབྱོར་འདི་ཡང་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ།
en: Cultivated] without apprehending anything, this indeed, Subhūti, is the Great Vehicle of bodhisattva great beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟར་དབང་པོ་གསུམ་སྟེ།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings also entails the three faculties.

source: གསུམ་གང་ཞེ་ན། ཡོངས་སུ་མ་ཤེས་པ་ཡོངས་སུ་ཤེས་པར་བྱའོ། །ཞེས་བྱ་བའི་དབང་པོ་དང་། ཡོངས་སུ་ཤེས་པའི་དབང་པོ་དང་། ཡོངས་སུ་ཤེས་པས་རྟོགས་པའི་དབང་པོའོ། །དེ་ལ་ཡོངས་སུ་མ་ཤེས་པར་ཡོངས་སུ་ཤེས་པར་བྱའོ།
en: If you ask what these three are, they comprise (1) the faculty whereby one will comprehend that which has not been comprehended, (2) the faculty of comprehension, and (3) the faculty of realization through comprehension.

source: །ཞེས་བྱ་བའི་དབང་པོ་གང་ཞེ་ན། སློབ་པའི་གང་ཟག་མངོན་པར་རྟོགས་པར་མ་གྱུར་པ་རྣམས་ཀྱི་དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་།
en: If you ask what is the faculty whereby one will comprehend that which has not been comprehended, it comprises the faculty of faith, the faculty of perseverance, the faculty of mindfulness, the faculty of meditative stability, and the faculty of wisdom, which are not fully manifest in the case of those individual disciples who are unrealized.

source: ཤེས་རབ་ཀྱི་དབང་པོ་ཡོངས་སུ་སྣང་བར་མ་གྱུར་པ་འདི་ནི། ཡོངས་སུ་མ་ཤེས་པ་ཡོངས་སུ་ཤེས་པར་བྱའོ་ཞེས་བྱ་བའི་དབང་པོའོ།
en: This is the faculty whereby one will comprehend that which has not been comprehended.

source: །དེ་ལ་ཡོངས་སུ་ཤེས་པའི་དབང་པོ་གང་ཞེ་ན། གང་ཟག་སློབ་པ་ཡོངས་སུ་ཤེས་པར་གྱུར་པ་རྣམས་ཀྱི་དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་།
en: If you ask what is the faculty of comprehension, it comprises the faculty of faith, the faculty of perseverance, the faculty of mindfulness, the faculty of meditative stability, and the faculty of wisdom in the case of individual disciples who have acquired comprehension.

source: ཤེས་རབ་ཀྱི་དབང་པོ་སྟེ། འདི་ནི་ཡོངས་སུ་ཤེས་པའི་དབང་པོ་ཞེས་བྱའོ།
en: This is called the faculty of comprehension.

source: །དེ་ལ་ཡོངས་སུ་ཤེས་པས་རྟོགས་པའི་དབང་པོ་གང་ཞེ་ན། གང་ཟག་མི་སློབ་པ་དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་།
en: If you ask what is the faculty of realization through comprehension, it comprises the faculty of faith, the faculty of perseverance, the faculty of mindfulness, the faculty of meditative stability, and the faculty of wisdom in the case of individual disciples who are arhats, pratyekabuddhas, bodhisattvas, or tathāgatas.

source: དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་སྟེ། རབ་འབྱོར་འདི་ནི་ཡོངས་སུ་ཤེས་པས་རྟོགས་པའི་དབང་པོ་ཞེས་བྱ་སྟེ།
en: This, Subhūti, is called the faculty of realization through comprehension. [

source: རབ་འབྱོར་འདི་ཡང་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ།
en: Cultivated] without apprehending anything, this indeed, Subhūti, is the Great Vehicle of bodhisattva great beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟར་ཏིང་ངེ་འཛིན་གསུམ་སྟེ།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings also entails the three meditative stabilities.
